ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_adc.h
/**
*********************************************************************************************************
*               Copyright(c) 2020, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl876x_adc.h
* \brief    The header file of the peripheral ADC driver.
* \details  This file provides all ADC firmware functions.
* \author   yuan
* \date     2020-05-28
* \version  v2.1.0
* *********************************************************************************************************
*/


#ifndef _RTL876X_ADC_H_
#define _RTL876X_ADC_H_

#ifdef __cplusplus
extern "C" {
#endif

/**
 * \addtogroup  IO          Peripheral Drivers
 * \defgroup    ADC         ADC
 *
 * \brief       Manage the ADC peripheral functions.
 *
 * \ingroup     IO
 */

/*============================================================================*
 *                         Includes
 *============================================================================*/
#include "rtl876x.h"
#include "rtl876x_alias.h"
#include "platform_utils.h"
#include "adc_lib.h"


/*============================================================================*
 *                         Types
 *============================================================================*/

/**
 * \defgroup    ADC_Exported_Types  Init Params Struct
 *
 * \ingroup     ADC
 */

/**
 * \brief       ADC initialize parameters
 *
 * \ingroup     ADC_Exported_Types
 */
typedef struct
{
    uint32_t ADC_SampleTime;        /**< Specifies the ADC sample clock, adc_sample_period = (n+1) cycles from 10MHz.
                                            This parameter can be a value of 0~255 or 2048~14591. */
    uint32_t ADC_ConvertTime;       /**< Specifies the ADC Sample convert time.
                                            This parameter can be a value of \ref ADC_Convert_Time*/
    uint32_t ADC_DataWriteToFifo;   /**< Enable or disable writing ADC sampling data to FIFO in one shot mode.
                                            This parameter can be a value of \ref ADC_Data_Write_To_Fifo*/
    uint32_t ADC_FifoThdLevel;      /**< Specifies the ADC FIFO threshold to trigger \ref ADC_INT_FIFO_THD interrupt.
                                            This parameter can be a value of 0 to 31. */
    uint32_t ADC_WaterLevel;        /**< Specifies the ADC FIFO burst size to trigger GDMA.
                                            This parameter can be a value of 0 to 31. */
    uint32_t ADC_FifoOverWriteEn;   /**< Specifies if over write FIFO when FIFO overflow.
                                            This parameter can be a value of \ref ADC_Over_Write_Enable. */
    uint32_t ADC_DataLatchEdge;     /**< Specifies ADC data latch edge.
                                            This parameter can be a value of \ref ADC_Latch_Data_Edge. */
    uint16_t ADC_SchIndex[16];      /**< Specifies ADC mode and channel for schedule table.
                                            This parameter can be a value of \ref ADC_Schedule_Table. */
    uint16_t ADC_Bitmap;            /**< Specifies the schedule table channel map.
                                            This parameter can be a value of 16-bit map. */
    uint32_t ADC_TimerTriggerEn;    /**< Enable ADC one-shot mode when tim7 toggles. */
    uint32_t ADC_DataAlign;         /**< ADC data MSB or LSB aligned. */
    uint32_t ADC_DataMinusEn;       /**< Enable or disable function that adc data latched minus the given offset before writes to reg/FIFO. */
    uint32_t ADC_DataMinusOffset;   /**< Offset to be minused from adc data latched. */
    uint32_t ADC_DataAvgSel;        /**< Number of data for calculate average.
                                            This parameter can be a value of \ref ADC_Data_Avg_Num. */
    uint32_t ADC_DataAvgEn;         /**< Enable the calculation for average result of the one-shot data.
                                            This parameter can be a value of \ref ADC_Data_Avg_En. */
    uint32_t ADC_PowerOnMode;       /**< Specifies ADC power on mode.
                                            This parameter can be a value of \ref ADC_Power_On_Mode. */
    uint32_t ADC_PowerAlwaysOnEn;   /**< Specifies the power always on.
                                            This parameter can be a value of \ref ADC_Power_Always_On_Cmd. */
    uint32_t ADC_DataLatchDly;      /**< Specifies delay of ck_ad to latch data.*/
    uint32_t ADC_RG2X0Dly;          /**< Specifies the power on delay time selection of RG2X_AUXADC[0].
                                            This parameter can be a value of \ref ADC_RG2X_0_Delay_Time */
    uint32_t ADC_RG0X1Dly;          /**< Specifies the power on delay time selection of RG0X_AUXADC[1].
                                            This parameter can be a value of \ref ADC_RG0X_1_Delay_Time */
    uint32_t ADC_RG0X0Dly;          /**< Specifies the power on delay time selection of RG0X_AUXADC[0].
                                            This parameter can be a value of \ref ADC_RG0X_0_Delay_Time */
} ADC_InitTypeDef;

/*============================================================================*
 *                         Constants
 *============================================================================*/

/**
 * \defgroup    ADC_Exported_Constants  Macro Definitions
 * \ingroup     ADC
 */

#define IS_ADC_PERIPH(PERIPH) ((PERIPH) == ADC)

/** \defgroup   ADC_Data_Write_To_Fifo  Write DATA To FIFO
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_DATA_WRITE_TO_FIFO_DISABLE              ((uint32_t)(0 << 27))
#define ADC_DATA_WRITE_TO_FIFO_ENABLE               ((uint32_t)(1 << 27))
/** \} */

#define IS_ADC_DATA_WRITE_TO_FIFO_CMD(CMD) (((CMD) == ADC_DATA_WRITE_TO_FIFO_DISABLE) || ((CMD) == ADC_DATA_WRITE_TO_FIFO_ENABLE))

/**
 * \def     ADC_FIFO_Threshold  ADC FIFO Threshold
 */
#define IS_ADC_FIFO_THRESHOLD(THD) ((THD) <= 0x3F)

/**
 * \def     ADC_Burst_Size  ADC Burst Size
 */
#define IS_ADC_WATER_LEVEL_CONFIG(CONFIG) ((CONFIG) <= 0x3F)

/**
 * \defgroup    ADC_Over_Write_Enable ADC FIFO Over Write
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_FIFO_OVER_WRITE_DISABLE                 ((uint32_t)(0 << 13))
#define ADC_FIFO_OVER_WRITE_ENABLE                  ((uint32_t)(1 << 13))
/** \} */

#define IS_ADC_OVERWRITE_MODE(MODE) (((MODE) == ADC_FIFO_OVER_WRITE_DISABLE) || ((MODE) == ADC_FIFO_OVER_WRITE_ENABLE))

/**
 * \defgroup    ADC_Latch_Data_Edge ADC Latch Data Edge
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_LATCH_DATA_Positive                     ((uint32_t)(0 << 2))
#define ADC_LATCH_DATA_Negative                     ((uint32_t)(1 << 2))
/** \} */

