ART-Badge/SDK/bsp_for_art-badge/libraries/inc/peripheral/rtl876x_adc.h
#define IS_ADC_LATCH_DATA_EDGE(EDGE) (((EDGE) == ADC_LATCH_DATA_Positive) || ((EDGE) == ADC_LATCH_DATA_Negative))

/**
 * \defgroup    ADC_Operation_Mode ADC Operation Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */

#define ADC_CONTINUOUS_MODE                         ((uint32_t)(1 << 0))
#define ADC_ONE_SHOT_MODE                           ((uint32_t)(1 << 1))
/** \} */

#define IS_ADC_SAMPLE_MODE(MODE) (((MODE) == ADC_CONTINUOUS_MODE) || ((MODE) == ADC_ONE_SHOT_MODE))

/**
 * \defgroup    ADC_Interrupts_Definition ADC Interrupts Definition
 * \{
 * \ingroup     ADC_Exported_Constants
 */

#define ADC_INT_FIFO_RD_REQ                         ((uint32_t)(1 << 0))
#define ADC_INT_FIFO_RD_ERR                         ((uint32_t)(1 << 1))
#define ADC_INT_FIFO_THD                            ((uint32_t)(1 << 2))
#define ADC_INT_FIFO_OVERFLOW                       ((uint32_t)(1 << 3))
#define ADC_INT_ONE_SHOT_DONE                       ((uint32_t)(1 << 4))
/** \} */

//#define IS_ADC_INT(INT) ((((INT) & 0xFFFFFFE0) == 0x00) && ((INT) != 0x00))

#define IS_ADC_INT(INT) (((INT) == ADC_INT_FIFO_RD_REQ) || ((INT) == ADC_INT_FIFO_RD_ERR)\
                         || ((INT) == ADC_INT_FIFO_THD) || ((INT) == ADC_INT_FIFO_OVERFLOW)\
                         || ((INT) == ADC_INT_ONE_SHOT_DONE))

/**
 * \defgroup    ADC_Schedule_Table ADC Channel and Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define EXT_SINGLE_ENDED(index)                     ((uint16_t)((0x00 << 3) | (index)))
#define EXT_DIFFERENTIAL(index)                     ((uint16_t)((0x01 << 3) | (index)))
#define INTERNAL_VBAT_MODE                          ((uint16_t)((0x02 << 3) | 0x00))
/** \} */

#define SCHEDULE_TABLE(index)                       (index)
#define IS_ADC_SCHEDULE_INDEX_CONFIG(CONFIG) ((((CONFIG) & 0xFFE0) == 0) && ((((~(CONFIG)) & (0x18)) != 0)\
                                                                             || ((CONFIG) == INTERNAL_VBAT_MODE)))

/**
 * \defgroup    ADC_Data_Avg_Num ADC Data Averge Num
 * \{
 * \brief       Number of raw data for calculate average.
 * \ingroup     ADC_Exported_Constants
 */

#define ADC_DATA_AVERAGE_OF_2                       ((uint32_t)(0 << 25))
#define ADC_DATA_AVERAGE_OF_4                       ((uint32_t)(1 << 25))
#define ADC_DATA_AVERAGE_OF_8                       ((uint32_t)(2 << 25))
#define ADC_DATA_AVERAGE_OF_16                      ((uint32_t)(3 << 25))
#define ADC_DATA_AVERAGE_OF_32                      ((uint32_t)(4 << 25))
#define ADC_DATA_AVERAGE_OF_64                      ((uint32_t)(5 << 25))
#define ADC_DATA_AVERAGE_OF_128                     ((uint32_t)(6 << 25))
#define ADC_DATA_AVERAGE_OF_256                     ((uint32_t)(7 << 25))
/** \} */

#define IS_ADC_DATA_AVG_NUM(NUM) (((NUM) == ADC_DATA_AVERAGE_OF_2) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_4) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_8) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_16) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_32) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_64) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_128) ||\
                                  ((NUM) == ADC_DATA_AVERAGE_OF_256))

/**
 * \defgroup    ADC_Data_Avg_En ADC Data Average Enable
 * \brief       Enable the calculation for average result of the one-shot mode.
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_DATA_AVERAGE_DISABLE                    ((uint32_t)(0 << 24))
#define ADC_DATA_AVERAGE_ENABLE                     ((uint32_t)(1 << 24))
/** \} */

#define IS_ADC_DATA_AVG_EN(CMD) (((CMD) == ADC_DATA_AVERAGE_DISABLE) || ((CMD) == ADC_DATA_AVERAGE_ENABLE))

/**
 * \defgroup    ADC_Power_On_Mode ADC Power On Mode
 * \{
 * \ingroup     ADC_Exported_Constants
 */

#define ADC_POWER_ON_AUTO                           ((uint32_t)(0 << 19))
#define ADC_POWER_ON_MANUAL                         ((uint32_t)(1 << 19))
/** \} */

#define IS_ADC_POWER_ON_MODE(MODE) (((MODE) == ADC_POWER_ON_AUTO) || ((MODE) == ADC_POWER_ON_MANUAL))

/**
 * \brief       ADC set power on procedure.
 */
#define IS_ADC_POWER_ON_PROCEDURE(CONFIG) (((CONFIG) == ADC_POWERON_VBAT) || ((CONFIG) == ADC_POWERON_VA11)\
                                           || ((CONFIG) == ADC_POWERON_RG1X_AUXADC_12) || ((CONFIG) == ADC_POWERON_RG2X_AUXADC_3))\
|| ((CONFIG) == ADC_POWERON_ERC_VA11) || ((CONFIG) == ADC_POWERON_RG2X_AUXADC_0))\
|| ((CONFIG) == ADC_POWERON_VA18) || ((CONFIG) == ADC_POWERON_RG0X_AUXADC_1))\
|| ((CONFIG) == ADC_POWERON_RG0X_AUXADC_0)))

/**
 * \defgroup    ADC_RG2X_0_Delay_Time ADC RG2X_0 Delay Time
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_RG2X_0_DELAY_10_US                      ((uint32_t)(0 << 4))
#define ADC_RG2X_0_DELAY_20_US                      ((uint32_t)(1 << 4))
#define ADC_RG2X_0_DELAY_40_US                      ((uint32_t)(2 << 4))
#define ADC_RG2X_0_DELAY_80_US                      ((uint32_t)(3 << 4))
/** \} */

#define IS_ADC_RG2X_0_DELAY_TIME(TIME) (((TIME) == ADC_RG2X_0_DELAY_10_US) || ((TIME) == ADC_RG2X_0_DELAY_20_US)\
                                        || ((TIME) == ADC_RG2X_0_DELAY_40_US) || ((TIME) == ADC_RG2X_0_DELAY_80_US))

/**
 * \defgroup    ADC_RG0X_1_Delay_Time ADC RG0X_1 Delay Time
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_RG0X_1_DELAY_20_US                      ((uint32_t)(0 << 2))
#define ADC_RG0X_1_DELAY_40_US                      ((uint32_t)(1 << 2))
#define ADC_RG0X_1_DELAY_80_US                      ((uint32_t)(2 << 2))
#define ADC_RG0X_1_DELAY_160_US                     ((uint32_t)(3 << 2))
/** \} */

#define IS_ADC_RG0X_1_DELAY_TIME(TIME) (((TIME) == ADC_RG0X_1_DELAY_20_US) || ((TIME) == ADC_RG0X_1_DELAY_40_US)\
                                        || ((TIME) == ADC_RG0X_1_DELAY_80_US) || ((TIME) == ADC_RG0X_1_DELAY_160_US))

/**
 * \defgroup    ADC_RG0X_0_Delay_Time ADC RG0X_0 Delay Time
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_RG0X_0_DELAY_30_US                      ((uint32_t)(0 << 0))
#define ADC_RG0X_0_DELAY_60_US                      ((uint32_t)(1 << 0))
#define ADC_RG0X_0_DELAY_120_US                     ((uint32_t)(2 << 0))
#define ADC_RG0X_0_DELAY_240_US                     ((uint32_t)(3 << 0))
/** \} */

#define IS_ADC_RG0X_0_DELAY_TIME(TIME) (((TIME) == ADC_RG0X_0_DELAY_30_US) || ((TIME) == ADC_RG0X_0_DELAY_60_US)\
                                        || ((TIME) == ADC_RG0X_0_DELAY_120_US) || ((TIME) == ADC_RG0X_0_DELAY_240_US))

/**
 * \defgroup    ADC_Data_Minus_En ADC Data Minus Enable
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_DATA_MINUS_DISABLE                      (uint32_t)(0 << 31)
#define ADC_DATA_MINUS_ENABLE                       (uint32_t)(1 << 31)
/** \} */

#define IS_ADC_DATA_MINUS_CMD(CMD) (((CMD) == ADC_DATA_MINUS_DISABLE) || ((CMD) == ADC_DATA_MINUS_ENABLE))

/**
 * \defgroup    ADC_Data_Align ADC Data Align
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_DATA_ALIGN_LSB                          (uint32_t)(0 << 30)
#define ADC_DATA_ALIGN_MSB                          (uint32_t)(1 << 30)
/** \} */

#define IS_ADC_DATA_ALIGN(DATA_ALIGN) (((DATA_ALIGN) == ADC_DATA_ALIGN_LSB) || ((DATA_ALIGN) == ADC_DATA_ALIGN_MSB))

/**
 * \defgroup    ADC_Timer_Trigger_En ADC Timer Trigger En
 * \brief       ADC trigger one-shot mode with timer7.
 * \{
 * \ingroup     ADC_Exported_Constants
 */
#define ADC_TIMER_TRIGGER_DISABLE                   ((uint32_t)(0 << 29))
#define ADC_TIMER_TRIGGER_ENABLE                    ((uint32_t)(1 << 29))
/** \} */

